{
  "id": "7ab22f0a-c9cd-449a-9137-c76e5055ca37",
  "hrid": "in000015",
  "source": "MARC",
  "title": "Poverty reduction strategies in Africa edited by Toyin Falola and Mike Odugbo Odey",
  "series": [
    "Global Africa 3"
  ],
  "identifiers": [
    {
      "value": "2017004333",
      "identifierTypeId": "c858e4f2-2b6b-4385-842b-60732ee14abb"
    },
    {
      "value": "9781138240667",
      "identifierTypeId": "8261054f-be78-422d-bd51-4ed9f33c3422"
    },
    {
      "value": "9781315282978",
      "identifierTypeId": "8261054f-be78-422d-bd51-4ed9f33c3422"
    },
    {
      "value": "(DE-599)GBV880159367",
      "identifierTypeId": "7e591197-f335-4afb-bc6d-a6d76ca3bace"
    }
  ],
  "contributors": [
    {
      "contributorNameTypeId": "2b94c631-fca9-4892-a730-03ee529ffe2a",
      "name": "Falola, Toyin"
    },
    {
      "contributorNameTypeId": "2b94c631-fca9-4892-a730-03ee529ffe2a",
      "name": "Odey, Mike Odugbo"
    }
  ],
  "subjects": [
    "Poverty--Government policy--Africa, Sub-Saharan",
    "Armut",
    "Bek채mpfung",
    "Armutsbek채mpfung",
    "Subsahara-Afrika",
    "Westafrika",
    "Africa, Sub-Saharan--Economic conditions--21st century",
    "Subsaharisches Afrika",
    "Africa, Sub-Saharan Economic conditions 21st century",
    "Poverty Government policy Africa, Sub-Saharan"
  ],
  "classifications": [
    {
      "classificationNumber": "HV438.A357",
      "classificationTypeId": "ce176ace-a53e-4b4d-aa89-725ed7b2edac"
    },
    {
      "classificationNumber": "362.50967",
      "classificationTypeId": "42471af9-7d25-4f3a-bf78-60d29dcf463b"
    }
  ],
  "publication": [
    {
      "publisher": "Routledge",
      "place": "London",
      "dateOfPublication": "2018"
    }
  ],
  "electronicAccess": [
    {
      "uri": "http://www.gbv.de/dms/zbw/880159367.pdf",
      "linkText": "Electronic resource (PDF)",
      "publicNote": "Address for accessing the table of content. PDF file"
    } 
  ],
  "instanceTypeId": "6312d172-f0cf-40f6-b27d-9fa8feaf332f",
  "physicalDescriptions": [
    "xiv, 300 Seiten"
  ],
  "languages": [
    "eng"
  ],
  "notes": [
    "Enth채lt 16 Beitr채ge",
    "Includes bibliographical references and index",
    "Introduction / Mike Odugbo Odey and Toyin Falola -- Part I: Dimensions and assessments of poverty reduction policies and programs in Sub-Saharan Africa -- Poverty in post-colonial Africa: the legacy of contested perspectives / Sati U. Fwatshak -- Scaling up power infrastructure investment in Sub-Saharan Africa for poverty alleviation / Aori R. Nyambati -- The impact of anti-corruption conventions in Sub-Saharan Africa / Daniel Barkley and Claire Maduka -- The besieged continent: interrogating contemporary issues of corruption and poverty in Africa / Idris S. Jimada -- PEPFAR and preventing HIV transmission: evidence from Sub-Saharan Africa / Daniel Barkley and Opeyemi Adeniyi -- Reflections on the current challenges of poverty reduction in Africa / Loveday N. Gbara -- A critical analysis of poverty reduction strategies in post-colonial Africa / Okokhere O. Felix -- Part II: Problems of good governance and institutional failures in West-Africa -- Weaknesses and failures of poverty reduction policies and programs in Nigeria since 1960 / Mike O. Odey -- In the web of neo-liberalism and deepening contradictions? Assessing poverty reform strategies in West Africa since the mid-1980s / Okpeh O. Okpeh, Jr. -- An assessment of abuse of the elderly as an aspect of poverty in Akwa-Ibom State, Nigeria / Ekot O. Mildred -- Reflections on the interface between poverty and food insecurity in Nigeria / Funso A. Adesola -- An appraisal of poverty reduction program in Bayelsa State of Nigeria: \\\"In-Care of the People\\\" (COPE) / Ezi Beedie -- A comparative analysis of incidence of poverty in three urban centers in Ghana from 1945-1990 / Wilhelmina J. Donkoh -- Part III: Dimensions of poverty in east and southern Africa -- Landlessness, national politics, and the future of land reforms in Kenya / Shanguhyia S. Martin -- Extra-version and development in northwestern Ethiopia: the case of the Humera Agricultural Project (1967-1975) / Luca Pudu -- Affirmative action as a theological-pastoral challenge in the south-African democratic context / Elijah M. Baloyi."
  ]
}
